Revit 2026 API

# ExternallyTaggedNonBRep Methods

---

The ExternallyTaggedNonBRep type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from ExternallyTaggedGeometryObject) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetUsage | Controls the usage of this ExternallyTaggedNonBRep. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

ExternallyTaggedNonBRep Class

Autodesk.Revit.DB Namespace